{
  "add_ecos_btn": "New survey",
  "my_searchs": "My surveys",
  "view_search": "View",
  "modal_text": {
    "cancel_btn": "Cancel",
    "label_name": "Organization name",
    "txt1": "This tool allows the organization to obtain valuable insights through the analysis of the feelings of professionals involved in requirements management about the social and human factors that influence their activities in the work environment. The tool allows feedback collection through a structured questionnaire in the form of an organizational survey. The results obtained with the organizational survey can provide relevant information to support decision-making related to social and human factors, aiming to improve requirements management activities.",
    "txt2": "Attention: It is necessary to configure the survey properly to accurately capture the participants' perception. Please fill in the requested data in each section.",
    "txt3": "Enter your organization's name:",
    "time_window_separator": "Time to take the survey",
    "end_date_text": "Select the date when the survey will end:",
    "time_window_label": "How much time will participants have to respond to the survey?",
    "end_date_label": "Survey end date*",
    "time_week": "week",
    "end_date_error": "Please select the survey end date",
    "demographic_data_title": "Demographic Data",
    "demographic_data_expl": "This data is mandatory for the survey and will be collected from participants.",
    "create_new_survey": "Create new survey",
    "shf_items": "Please select the social and human factors that will be mandatory in the survey:",
    "shf_items_expl": "Attention: social and human factors that are not selected as mandatory responses will be listed so that participants can indicate if they are critical in requirements management.",
    "cc_items": "Please select the contextual characteristics of your organization's requirements management:",
    "barriers_items": "Please select the barriers to improvement that will be mandatory in the survey:",
    "barriers_items_expl": "Attention: the other barriers that are not selected as mandatory responses will be listed so that participants can indicate if they are critical in requirements management.",
    "strategies_items": "Please select the strategies that will be mandatory in the survey:",
    "strategies_items_expl": "Attention: Select only the strategies that have been applied. The other strategies that are not selected as mandatory responses will be listed so that participants can indicate if they are critical in requirements management.",
    "add_participants_tite": "Add participants",
    "email_label": "Participant's email",
    "add_participant_btn": "Add",
    "participants_list_title": "Participants list",
    "edit_survey": "Edit survey",
    "end_date_obs": "Note: The survey will end on the end date at 6:00 p.m."
  },
  "delete_project": {
    "success": "Project successfully deleted!",
    "error": "Error deleting project!",
    "confirm_title": "Delete project",
    "confirm_text": "Are you sure you want to delete the project ",
    "confirm_text2": "This will permanently delete the project and all associated responses!",
    "cancel_btn": "Cancel",
    "delete_btn": "Delete"
  }
}