{
	"back_btn": "Back",
	"next_btn": "Next",
  "snackbar_text": "Thanks for your answer!",
  "welcome_text": "Welcome to the Research on Social and Human Factors in Software Ecosystems!",
  "fsh_affirmative": "The social and human factors listed below influence requirements management in software ecosystems.",
  "cc_affirmative": "The contextual characteristics of requirements management in software ecosystems listed below have an impact on the importance of considering social and human factors.",
  "barriers_affirmative": "The barriers listed below hinder the improvement of social and human factors in requirements management in software ecosystems.",
  "strategies_affirmative": "The improvement strategies listed below can be used to overcome barriers and enhance social and human factors.",
  "coping_mec_affirmative": "The coping mechanisms listed below can be used when improvement strategies do not work.",
  "instructions": {
    "p1": "The components and items presented here represent the vision of a conceptual action framework for understanding and improving social and human factors that influence requirements management in software ecosystems. These components and their items were identified in a rapid review study on social and human factors in requirements engineering in software ecosystems (Citation of the rapid review) and in a field study on social and human factors in requirements management in software ecosystems (Citation of the field study). Each of the components and items is accompanied by its definition derived from studies related to social and human factors in requirements management in software ecosystems.",
    "p2": "Instructions for the analysis of components and their items:",
    "i1": "Read the definition of the components and their respective items;",
    "i2": "Carefully analyze each statement associated with the components and items;",
    "i3": "Respond according to the reality of your organization (software ecosystem);",
    "i4": "Mark your response among the options: (“Strongly Agree”, “Agree”, “Neither Agree nor Disagree”, “Disagree”, or “Strongly Disagree”)."
  },
  "survey_options": {
    "strongly_agree": "Strongly Agree",
    "agree": "Agree",
    "neither": "Neither Agree nor Disagree",
    "disagree": "Disagree",
    "strongly_disagree": "Strongly Disagree"
  },
  "item_name": "Name",
  "view_answer_btn": "View answer",
  "save_btn": "Save",
  "answers_saved": "Answers saved successfully!",
  "answers_not_saved": "An error occurred while saving your answers. Please try again."
}
