{
  "back_btn": "Back",
  "next_btn": "Next",
  "snackbar_text": "Thanks for your answer!",
  "welcome_text": "Welcome to the survey on social and human factors in requirements management in software ecosystems!",
  "instructions": {
    "p1": "This survey presents data that reflects the vision of a conceptual action framework aimed at dealing with social and human factors to improve requirements management activities in software ecosystems. Each item addressed is accompanied by a definition, derived from studies on social and human factors in requirements management in software ecosystems.",
    "p2": "Instructions for answer the survey:",
    "i1": "Read the definition of the items;",
    "i2": "Carefully analyze each statement of the items;",
    "i3": "Please, respond according to the reality of your organization;"
  },
  "consent_term": {
    "title": "Consent form",
    "p1": "You are invited to participate in a survey to understand the social and human factors influencing requirements management in your organization.",
    "p2": "Participation is voluntary, and you may withdraw at any time without any prejudice. The information collected will be used solely for scientific purposes, and there will be no identification of participants.",
    "p3": "By clicking “Agree”, you will agree to participate in the survey. If you have any questions, don't hesitate to contact the organization responsible for the survey.",
    "p4": "Do you agree to participate in the survey?"
  },
  "demographic_data_label": "Please, fill in the following demographic data before starting the survey:",
  "demographic_data_veiw_label": "Demographic data",
  "fsh_affirmative": "In the {{ecos_name}} ecosystem in which you operate, the central organization pointed out some social and human factors, listed below, that may be influencing requirements management. For each factor, indicate whether you agree or disagree:",
  "fsh_optional": "Listed below are some social and human factors that can influence requirements management in software ecosystems. If you consider any of these factors to be critical in the {{ecos_name}} ecosystem, please select them by clicking on each one.",
  "cc_affirmative": "The contextual characteristics of requirements management in software ecosystems listed below have an impact on the importance of considering social and human factors.",
  "barriers_affirmative": "The central organization pointed out some barriers, listed below, that may be preventing the improvement of social and human factors in requirements management in the {{ecos_name}} ecosystem. For each barrier, indicate whether you agree or disagree.",
  "barriers_optional": "Listed below are some barriers that may prevent the improvement of social and human factors in requirements management in software ecosystems. If you consider any of these barriers to be critical in the {{ecos_name}} ecosystem, please select them by clicking on each one.",
  "strategies_affirmative": "Given the strategies listed below, indicated by the central organization, indicate whether they helped improve social and human factors and overcome barriers in requirements management in the {{ecos_name}} ecosystem. For each strategy, indicate whether you agree or disagree.",
  "strategies_optional": "Listed below are some strategies that can help improve FSH and overcome barriers in requirements management in software ecosystems. If you consider that any of these strategies can be used in the {{ecos_name}} ecosystem, please select them by clicking on each one of them.",
  "coping_mec_affirmative": "Listed below are some coping mechanisms that can be used when strategies are not effective to improve social and human factors and overcome barriers in requirements management in software ecosystems.",
  "survey_options": {
    "strongly_agree": "Strongly Agree",
    "agree": "Agree",
    "neither": "Neither Agree nor Disagree",
    "disagree": "Disagree",
    "strongly_disagree": "Strongly Disagree"
  },
  "item_name": "Name",
  "view_answer_btn": "View answer",
  "save_btn": "Save",
  "answers_saved": "Answers saved successfully!",
  "answers_not_saved": "An error occurred while saving your answers. Please try again.",
  "errors": {
    "title": "Error",
    "already_answered": "You have already answered this survey for this round. You will be redirected to the dashboard.",
    "not_accept_answers": "This ecosystem is not waiting for answers right now. Please wait for the next round begin."
  },
  "agree_btn": "Agree",
  "feedback": {
    "title": "Leave your feedback for ",
    "textarea_label": "Leave your feedback here",
    "error": "For the item(s) flagged in red, the user must indicate whether they agree or disagree, as well as leave feedback."
  },
  "validation_error": "Please, answer all questions before moving on the next step.",
  "view_answers": {
    "title": "View your answers below",
    "fsh_affirmative": {
      "title": "Social and Human Factors",
      "critical": "Critical Social and Human Factors"
    },
    "cc_affirmative": {
      "title": "Contextual Characteristics",
      "critical": "Critical Contextual Characteristics"
    },
    "barriers_affirmative": {
      "title": "Barriers",
      "critical": "Critical Barriers"
    },
    "strategies_affirmative": {
      "title": "Improvement Strategies",
      "critical": "Critical Strategies"
    },
    "name": "Name",
    "answer": "Answer",
    "feedback": "Feedback"
  }
}