{
  "add_ecos_btn": "Nova pesquisa",
  "my_searchs": "Minhas pesquisas",
  "view_search": "Visualizar",
  "modal_text": {
    "cancel_btn": "Cancelar",
    "label_name": "Nome da organização",
    "txt1": "Esta ferramenta permite que a organização obtenha insights valiosos por meio da percepção dos profissionais (envolvidos na gerência de requisitos) sobre os fatores sociais e humanos que influenciam as atividades da gerência de requisitos em seu ambiente. A ferramenta permite a coleta de feedback por meio de questionário estruturado em formato de pesquisa organizacional e também pode ser utilizada para coletar feedback por meio de métodos não estruturados (por exemplo, retrospectivas, reuniões individuais). Os resultados obtidos com a ferramenta podem fornecer informações relevantes para embasar a tomada de decisão na melhoria dos fatores sociais e humanos que influenciam a gerência de requisitos em seu ambiente específico. ",
    "txt2": "Informe o nome da sua organização:",
    "time_window_separator": "Tempo para responder a pesquisa",
    "end_date_text": "Selecione a data em que a pesquisa irá terminar:",
    "end_date_label": "Data de término da pesquisa*",
    "time_week": "semana",
    "end_date_error": "Por favor, selecione a data de término da pesquisa",
    "demographic_data_title": "Dados Demográficos",
    "demographic_data_expl": " Esses dados são obrigatórios para a pesquisa, e serão coletados dos participantes.",
    "create_new_survey": "Criar nova pesquisa",
    "shf_items": "Por favor, selecione os fatores sociais e humanos que serão obrigatórios na pesquisa:",
    "cc_items": "Por favor, selecione as características contextuais da sua organização:",
    "barriers_items": "Por favor, selecione as barreiras para melhoria que serão obrigatórias na pesquisa:",
    "strategies_items": "Por favor, selecione as estratégias que serão obrigatórias na pesquisa:",
    "add_participants_tite": "Adicionar participantes",
    "email_label": "E-mail do participante",
    "add_participant_btn": "Adicionar",
    "participants_list_title": "Lista de participantes"
  }
}