{
  "add_ecos_btn": "Nova pesquisa",
  "my_searchs": "Minhas pesquisas",
  "view_search": "Visualizar",
  "modal_text": {
    "cancel_btn": "Cancelar",
    "label_name": "Nome da organização",
    "txt1": "Esta ferramenta permite à organização obter insights valiosos por meio da análise dos sentimentos dos profissionais envolvidos na gerência de requisitos sobre os fatores sociais e humanos que influenciam suas atividades no ambiente de trabalho. A ferramenta permite a coleta de feedback por meio de questionário estruturado em formato de pesquisa organizacional. Os resultados obtidos com a pesquisa organizacional podem fornecer informações relevantes para apoiar a tomada de decisões relacionadas aos fatores sociais e humanos, visando melhorar as atividades de gerência de requisitos.",
    "txt2": "Atenção: É necessário configurar a pesquisa adequadamente para capturar com precisão a percepção dos participantes. Por favor, preencha os dados solicitados em cada seção.",
    "txt3": "Informe o nome da sua organização:",
    "time_window_separator": "Tempo para responder a pesquisa",
    "end_date_text": "Selecione a data em que a pesquisa irá terminar:",
    "end_date_label": "Data de término da pesquisa*",
    "time_week": "semana",
    "end_date_error": "Por favor, selecione a data de término da pesquisa",
    "demographic_data_title": "Dados Demográficos",
    "demographic_data_expl": " Esses dados são obrigatórios para a pesquisa, e serão coletados dos participantes.",
    "create_new_survey": "Criar nova pesquisa",
    "shf_items": "Por favor, selecione os fatores sociais e humanos que os participantes deverão responder obrigatoriamente na pesquisa:",
    "shf_items_expl": "Atenção: os fatores sociais e humanos que não forem selecionados como resposta obrigatória serão listados para que os participantes possam indicar se são críticos na gerência de requisitos.",
    "cc_items": "Por favor, selecione as características contextuais da gerência de requisitos da sua organização:",
    "barriers_items": "Por favor, selecione as possíveis barreiras que os profissionais podem estar enfrentando para melhorar os fatores sociais e humanos, que deverão ser respondidos obrigatoriamente na pesquisa:",
    "barriers_items_expl": "Atenção: as demais barreiras que não forem selecionadas como resposta obrigatória serão listadas para que os participantes possam indicar se são críticas na gerência de requisitos.",
    "strategies_items": "Por favor, selecione as estratégias que já foram aplicadas na sua organização para superar as barreiras e melhorar os fatores sociais e humanos, os quais deverão ser respondidos obrigatoriamente na pesquisa:",
    "strategies_items_expl": "Atenção: Selecione apenas as estratégias que foram aplicadas. As demais estratégias, não selecionadas como resposta obrigatória, serão listadas para que os participantes possam indicar se são críticas na gerência de requisitos.",
    "add_participants_tite": "Adicionar participantes",
    "email_label": "E-mail do participante",
    "add_participant_btn": "Adicionar",
    "participants_list_title": "Lista de participantes",
    "edit_survey": "Editar pesquisa",
    "end_date_obs": "Observação: A pesquisa irá encerrar na data de término às 18h."
  }
}