{
	"back_btn": "Voltar",
	"next_btn": "Próximo",
  "snackbar_text": "Obrigado pela sua resposta!",
  "welcome_text": "Seja bem vindo a Pesquisa sobre Fatores Sociais e Humanos em Ecossistemas de Software!",
  "fsh_affirmative": "Os fatores sociais e humanos abaixo listados  influenciam a gerência de requisitos em ecossistemas de software.",
  "cc_affirmative": "As características contextuais da gerência de requisitos em ecossistemas de software abaixo listadas têm um impacto na importância de considerar os fatores sociais e humanos.",
  "barriers_affirmative": "As barreiras listadas abaixo impedem a melhoria dos fatores sociais e humanos na gerência de requisitos em ecossistemas de software.",
  "strategies_affirmative": "As estratégias de melhorias abaixo listadas podem ser utilizadas para superar as barreiras e melhorar os fatores sociais e humanos.",
  "coping_mec_affirmative": "Os mecanismos de enfrentamento listados abaixo podem ser utilizados quando as estratégias de melhoria não funcionam.",
  "instructions": {
    "p1": "Os componentes e itens aqui apresentados representam a visão de um framework conceitual de ação para entender e melhorar fatores sociais e humanos que influenciam a gerência de requisitos em ecossistemas de software. Identificou-se esses componentes e seus itens em um estudo de rapid review sobre fatores sociais e humanos na engenharia de requisitos em ecossistemas de software (Citação da rapid review) e em um estudo de campo sobre fatores sociais e humanos na gerência de requisitos em ecossistemas de software (Citação do estudo de campo). Cada um dos componentes e itens é acompanhado de sua definição derivados de estudos relacionados a fatores sociais e humanos na gerência de requisitos em ecossistemas de software.",
    "p2": " Instruções para análise dos componentes e seus itens:",
    "i1": "Leia a definição dos componentes e seus respectivos itens;",
    "i2": "Analise cuidadosamente cada afirmação associada aos componentes e itens;",
    "i3": "Responda de acordo com a realidade da sua organização (ecossistema de software);",
    "i4": "Marque sua resposta entre as opções: (“Concordo totalmente”, “Concordo”, “Não concordo e nem discordo”, “Discordo” ou “Discordo totalmente”)."
  },
  "survey_options":{
    "strongly_agree": "Concordo totalmente",
    "agree": "Concordo",
    "neither": "Não concordo e nem discordo",
    "disagree": "Discordo",
    "strongly_disagree": "Discordo totalmente"
  },
  "item_name": "Nome",
  "view_answer_btn": "Visualizar resposta",
  "save_btn": "Savlar",
  "answers_saved": "Respostas enviadas com sucesso!",
  "answers_not_saved": "Erro ao enviar respostas!"
}
