{
	"back_btn": "Voltar",
	"next_btn": "Próximo",
  "snackbar_text": "Obrigado pela sua resposta!",
  "welcome_text": "Seja bem-vindo à pesquisa sobre os fatores sociais e humanos na gerência de requisitos em ecossistemas de software!",
  "instructions": {
    "p1": "Os componentes e itens aqui apresentados representam a visão de um framework conceitual de ação para entender e melhorar fatores sociais e humanos que influenciam a gerência de requisitos em ecossistemas de software. Identificou-se esses componentes e seus itens em um estudo de rapid review sobre fatores sociais e humanos na engenharia de requisitos em ecossistemas de software (Citação da rapid review) e em um estudo de campo sobre fatores sociais e humanos na gerência de requisitos em ecossistemas de software (Citação do estudo de campo). Cada um dos componentes e itens é acompanhado de sua definição derivados de estudos relacionados a fatores sociais e humanos na gerência de requisitos em ecossistemas de software. ",
    "p2": "Instruções para responder a pesquisa:",
    "i1": "Leia a definição dos componentes e seus respectivos itens;",
    "i2": "Analise cuidadosamente cada afirmação associada aos componentes e itens;",
    "i3": "Responda de acordo com a realidade da sua organização (ecossistema de software);",
    "i4": "Marque sua resposta entre as opções: (“Concordo” ou “Discordo”)."
   },
   "consent_term": {
    "title": "Termo de consentimento livre e esclarecido",
    "p1": "Você está sendo convidado(a) a participar de uma pesquisa que tem como objetivo obter a sua percepção sobre os fatores sociais e humanos que influenciam a gerência de requisitos em sua organização.",
    "p2": "A participação é voluntária e você pode desistir a qualquer momento, sem qualquer prejuízo. As informações coletadas serão analisadas juntamente com as de outros participantes da pesquisa, garantindo o sigilo dos dados obtidos durante o processo. Sua identidade será mantida em sigilo; portanto, ao responder à pesquisa, suas respostas serão registradas de forma anônima, garantindo sua privacidade e confidencialidade.",
    "p3": "Ao clicar em “Concordo”, você estará concordando em participar da pesquisa. Caso tenha alguma dúvida, entre em contato com a organização responsável pela pesquisa.",
    "p4": "Você concorda em participar da pesquisa?"
  },
  "fsh_affirmative": "No ecossistema {{ecos_name}} em que você atua, a organização central apontou alguns fatores sociais e humanos, listados abaixo, que podem estar influenciando a gerência de requisitos. Para cada fator, indique se concorda ou discorda:",
  "fsh_optional": "Abaixo estão listados alguns fatores sociais e humanos que podem influenciar a gerência de requisitos em ecossistemas de software. Se você considerar algum desses fatores como crítico no ecossistema {{ecos_name}}, por favor, selecione-os clicando em cada um deles.",
  "cc_affirmative": "As características contextuais da gerência de requisitos em ecossistemas de software abaixo listadas têm um impacto na importância de considerar os fatores sociais e humanos.",
  "barriers_affirmative": "A organização central apontou algumas barreiras, listadas abaixo, que podem estar impedindo a melhoria dos fatores sociais e humanos na gerência de requisitos no ecossistema {{ecos_name}}. Para cada barreira, indique se concorda ou discorda.",
  "barriers_optional":"Abaixo estão listadas algumas barreiras que podem impedir a melhoria dos fatores sociais e humanos na gerência de requisitos em ecossistemas de software. Se você considerar alguma dessas barreiras como crítica no ecossistema {{ecos_name}}, por favor, selecione-as clicando em cada uma delas.",
  "strategies_affirmative": "Dadas as estratégias listadas abaixo, indicadas pela organização central, indique se elas ajudaram a melhorar os fatores sociais e humanos e superar as barreiras na gerência de requisitos no ecossistema {{ecos_name}}. Para cada estratégia, indique se concorda ou discorda.",
  "strategies_optional":"Abaixo estão listadas algumas estratégias que podem ajudar a melhorar os FSH e superar as barreiras na gerência de requisitos em ecossistemas de software. Se você considera que alguma dessas estratégias podem ser utilizadas no ecossistema {{ecos_name}}, por favor, seleciona-os clicando em cada uma delas.",
  "coping_mec_affirmative": "Os mecanismos de enfrentamento listados abaixo podem ser utilizados quando as estratégias de melhoria não funcionam.",
  "survey_options":{
    "strongly_agree": "Concordo totalmente",
    "agree": "Concordo",
    "neither": "Não concordo e nem discordo",
    "disagree": "Discordo",
    "strongly_disagree": "Discordo totalmente"
  },
  "item_name": "Nome",
  "view_answer_btn": "Visualizar resposta",
  "save_btn": "Savlar",
  "answers_saved": "Respostas enviadas com sucesso!",
  "answers_not_saved": "Erro ao enviar respostas!",
  "errors": {
    "title": "Ops!",
    "already_answered": "Você já respondeu a esta pesquisa para esta rodada. Você será redirecionado para o painel.",
    "not_accept_answers": "Este ecossistema não está esperando respostas no momento. Por favor, aguarde a próxima rodada ser iniciada."
  },
  "agree_btn": "Concordo",
  "feedback": {
    "title": "Deixe seu feedback para ",
    "textarea_label": "Deixe seu feedback aqui",
    "error": "Para os itens em que você respondeu \"Concordo Totalmente\" ou \"Discordo Totalmente\", por favor, escreva um comentário."
  },
  "validation_error": "Por favor, responda a todas as perguntas antes de passar para o próximo passo."
}
