{
	"list": {
		"1": {
			"description": " A primeira etapa é identificar os problemas. O primeiro passo para avaliar os fatores sociais e humanos que influenciam a gerência de requisitos em ecossistemas de software é conhecer os fatores do dia a dia dos profissionais que atuam nas atividades da gerência de requisitos e descobrir as características contextuais da gerência de requisitos. Com isso, pergunte aos profissionais da equipe quais fatores eles já enfrentaram, apresente a lista de barreiras que impedem os profissionais a lidar com os fatores sociais e humanos e entenda se eles já encontraram algumas em suas atividades na gerência de requisitos em ecossistemas de software. Pergunte quais estratégias de melhoria e mecanismos de enfrentamento os profissionais consideram que podem ser utilizados para lidar com os fatores sociais e humanos e superar as barreiras. A ferramenta permite coletar feedback por meio de questionário estruturado em formato de pesquisa organizacional e também pode ser utilizada para coletar feedback por meio de métodos não estruturados (por exemplo, retrospectivas, reuniões individuais). É fundamental que esta etapa seja feita individualmente.",
      "title": "Pergunte (Ask):"
		},
		"2": {
			"description": " As estratégias de melhoria devem ocorrer no nível individual da equipe e organizacional, dependendo dos fatores sociais e humanos e das barreiras identificadas. Após coletar o feedback, as respostas devem ser analisadas para determinar quais barreiras e fatores sociais e humanos requerem priorização para melhoria. Deve-se planejar as estratégias de melhoria e alocar recursos financeiros para retificação, se necessário. ",
      "title": "Planeje (Plan):"
		},
		"3": {
			"description": " Pequenas melhorias contínuas e iterativas são fundamentais. Implemente gradualmente as estratégias de melhoria e avalie se elas efetivamente abordam os fatores sociais e humanos e as barreiras. Acompanhar o sucesso das estratégias de melhoria é fundamental para lidar com os fatores sociais e humanos e superar as barreiras. Depois que as melhorias planejadas forem implementadas, repita esse processo de três etapas iterativamente para sustentar o progresso e abordar os fatores e barreiras, mantendo assim um processo de melhoria contínua.",
      	"title": "Execute (Act):"
		}
	},
	"title": "Diretrizes para utilização da ferramenta"
}
